import pandas as pd
import random

# サンプルデータの作成
prefecture_list = ['北海道'] * 10 + ['青森県'] * 10 + ['岩手県'] * 10 + ['宮城県'] * 10 + ['秋田県'] * 10 + \
                  ['山形県'] * 10 + ['福島県'] * 10 + ['茨城県'] * 10 + ['栃木県'] * 10 + ['群馬県'] * 10 + \
                  ['埼玉県'] * 10 + ['千葉県'] * 10 + ['東京都'] * 10 + ['神奈川県'] * 10 + ['新潟県'] * 10 + \
                  ['富山県'] * 10 + ['石川県'] * 10 + ['福井県'] * 10 + ['山梨県'] * 10 + ['長野県'] * 10 + \
                  ['岐阜県'] * 10 + ['静岡県'] * 10 + ['愛知県'] * 10 + ['三重県'] * 10 + ['滋賀県'] * 10 + \
                  ['京都府'] * 10 + ['大阪府'] * 10 + ['兵庫県'] * 10 + ['奈良県'] * 10 + ['和歌山県'] * 10 + \
                  ['鳥取県'] * 10 + ['島根県'] * 10 + ['岡山県'] * 10 + ['広島県'] * 10 + ['山口県'] * 10 + \
                  ['徳島県'] * 10 + ['香川県'] * 10 + ['愛媛県'] * 10 + ['高知県'] * 10 + ['福岡県'] * 10 + \
                  ['佐賀県'] * 10 + ['長崎県'] * 10 + ['熊本県'] * 10 + ['大分県'] * 10 + ['宮崎県'] * 10 + \
                  ['鹿児島県'] * 10 + ['沖縄県'] * 10

data = {
    '都道府県': prefecture_list,
    'year': [year for year in range(2014, 2024)] * 47,
    'yield': [random.randint(1000, 100000) for _ in range(470)],
}

df = pd.DataFrame(data)

# CSVファイルとして保存
df.to_csv('time_series_data.csv', index=False)